# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on One-to-Many and Many-to-many relationships!

## Objectives

You will be able to:
- Query data including Many-to-Many relationships
- Write queries that make use of Join Tables

## One-to-Many and Many-to-Many Joins
<img src='Database-Schema.png' width=550>

In [1]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [2]:
#Your code here
cur.execute('''select firstName, lastName, city, state from offices 
            join employees using(officeCode);''')
df = pd.DataFrame(cur.fetchall())
df.head()

         0          1              2   3
0  Anthony        Bow  San Francisco  CA
1     Jeff   Firrelli  San Francisco  CA
2   Leslie   Jennings  San Francisco  CA
3    Diane     Murphy  San Francisco  CA
4     Mary  Patterson  San Francisco  CA

## Customers and their Orders (a One-to-Many join)

Return a list of all of the customers. For each customer return a record for each of their order numbers, order dates and statuses.

In [3]:
# Your code here
cur.execute('''select orderNumber, orderDate, status from customers
                join orders using(customerNumber)''')
df = pd.DataFrame(cur.fetchall())
df.head()

       0           1        2
0  10123  2003-05-20  Shipped
1  10298  2004-09-27  Shipped
2  10345  2004-11-25  Shipped
3  10124  2003-05-21  Shipped
4  10278  2004-08-06  Shipped

## Orders and their Order Details (another One-to-Many join)

Return a list of orders. For each order return a record for each order detail within the order.

In [5]:
# Your code here
cur.execute('''select * from orders
                        join orderdetails
                        using(orderNumber)''')
df = pd.DataFrame(cur.fetchall())
df.head()

,0,1,2,3,4,5,6,7,8,9,10
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,S18_1749,30,136.00,3
1,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,S18_2248,50,55.09,2
2,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,S18_4409,22,75.46,4
3,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,S24_3969,49,35.29,1
4,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128,S18_2325,25,108.06,4

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of the orders with the the order information, and allthe product information for each product in the order.

In [4]:
# Your code here
cur.execute('''select * from orders
                        join payments
                        on orders.orderDate = payments.paymentDate;''')
df = pd.DataFrame(cur.fetchall())
df.head()

Number of results 118

,0,1,2,3,4,5,6,7,8,9,10
0,10116,2003-04-11,2003-04-19,2003-04-13,Shipped,,381,124,CQ287967,2003-04-11,11044.30
1,10117,2003-04-16,2003-04-24,2003-04-17,Shipped,,148,424,LM271923,2003-04-16,21665.98
2,10123,2003-05-20,2003-05-29,2003-05-22,Shipped,,103,114,GG31455,2003-05-20,45864.03
3,10124,2003-05-21,2003-05-29,2003-05-25,Shipped,Customer very concerned about the exact color ...,112,353,GT878649,2003-05-21,16700.47
4,10125,2003-05-21,2003-05-27,2003-05-24,Shipped,,114,353,GT878649,2003-05-21,16700.47

## Summary

In this lab, you practiced your knowledge on One-to-Many and Many-to-many relationships!